Tekla Open API Reference for Tekla Structures 2025
FacetedBrepWithNormals Properties
The FacetedBrepWithNormals type exposes the following members.
Properties
Name | Description
Faces
 Gets the faces.
 (Inherited from FacetedBrep.)
GetEdges
 Gets the edges.
 (Inherited from FacetedBrep.)
InnerWires
 Gets the inner wires.
 (Inherited from FacetedBrep.)
Normals
 Gets or sets the vertex normal unit vectors
OuterWires
 Gets the outer wires.
 (Inherited from FacetedBrep.)
Vertices
 Gets the vertices.
 (Inherited from FacetedBrep.)
Top
See Also
Reference
FacetedBrepWithNormals Class
Tekla.Structures.Geometry3d Namespace